app/Controllers/Admins/ArtikelController.php

    public function updateArtikel()
    {
        $artikelModel = new ArtikelModel();
        $id = $this->request->getVar('id_artikel');
        $artikel = $artikelModel->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id_artikel` = '4'