app/Controllers/Admins/GaleriController.php

SELECT *
FROM `galeri`
WHERE `galeri`.`id_galeri` = '5'
---
    public function updategaleri()
    {
        $galeriModel = new galeriModel();
        $id = $this->request->getVar('id_galeri');
        $galeri = $galeriModel->find($id);

UPDATE `galeri` SET `judul` = 'aasdas', `deskripsi` = 'mencoba deskripsi gambar galeri yang sangat panjang sekali lihat saja', `img` = 'uploads/galeri/1713589719_00145c63d560cbc69373.png'
WHERE `galeri`.`id_galeri` IN ('5')
---
            'foto' => $fotoPath
        ];

        $galeriModel->update($id, $data);