app/Controllers/LoginController.php

SELECT *
FROM `admin`
WHERE `username` = 'dwiprast13'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $AdminModel = new AdminModel();
        $login = $this->request->getPost('login');

        if ($login) {
            $admin_username = $this->request->getVar('admin_username');
            $admin_password = $this->request->getVar('admin_password');

            if (empty($admin_username) || empty($admin_password)) {
                session()->setFlashdata('error', "Silakan isi form inputan!");
                return redirect()->to('login');
            }

            $dataAdmin = $AdminModel->where("username", $admin_username)->first();