app/Models/AdminModel.php

SELECT COUNT(*) AS `numrows` FROM `admin`
---
    public function countTotalAdmin()
    {
        return $this->countAll();

SELECT *
FROM `admin`
---
    public function getAllAdmin()
    {
        return $this->findAll();