app/Models/ArtikelModel.php

    public function countTotalArtikel()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `artikel`

    public function getAllArtikel()
    {
        return $this->findAll();
---
SELECT *
FROM `artikel`

    public function getLatestArtikel($limit = 2)
    {
        return $this->db->table('artikel')
        ->orderBy('id_artikel', 'DESC')
        ->limit($limit)
            ->get()
            ->getResult();
---
SELECT *
FROM `artikel`
ORDER BY `id_artikel` DESC
 LIMIT 2

    public function getArtikelById($id)
    {
        return $this->where('id_artikel', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id_artikel` = '17'
 LIMIT 1