app/Models/DivisiModel.php

SELECT *
FROM `divisi`
---
    public function getAllDivsi()
    {
        return $this->findAll();