app/Models/GaleriModel.php

SELECT COUNT(*) AS `numrows` FROM `galeri`
---
    public function countTotalGaleri()
    {
        return $this->countAll();

SELECT *
FROM `galeri`
---
    public function getAllGaleri()
    {
        return $this->findAll();

SELECT *
FROM `galeri`
ORDER BY `id_galeri` DESC
 LIMIT 4
---
    public function getLatestGaleri($limit = 4)
    {
        return $this->db->table('galeri')
        ->orderBy('id_galeri', 'DESC')
        ->limit($limit)
            ->get()
            ->getResult();

SELECT *
FROM `galeri`
WHERE `id_galeri` = '5'
 LIMIT 1
---
    public function getGaleriById($id)
    {
        return $this->where('id_galeri', $id)->first();