app/Models/InfoModel.php

SELECT *
FROM `info`
ORDER BY `id_info` DESC
 LIMIT 4
---
    public function getLatestInfo($limit = 4)
    {
        return $this->db->table('info')
        ->orderBy('id_info', 'DESC')
        ->limit($limit)
            ->get()
            ->getResult();