app/Models/PengurusModel.php

    public function countTotalPengurus()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pengurus`

    public function getAllPengurus()
    {
        return $this->findAll();
---
SELECT *
FROM `pengurus`