app/Models/ProkerModel.php

    public function getAllProker()
    {
        return $this->findAll();
---
SELECT *
FROM `proker`